# Merge

In [1]:
import pandas as pd

In [2]:
# Sample raw data dictionaries
raw_data_1 = {
    "subject_id": ["1", "2", "3", "4", "5"],
    "first_name": ["Alex", "Amy", "Allen", "Alice", "Ayoung"],
    "last_name": ["Anderson", "Ackerman", "Ali", "Aoni", "Atiches"],
}

raw_data_2 = {
    "subject_id": ["4", "5", "6", "7", "8"],
    "first_name": ["Billy", "Brian", "Bran", "Bryce", "Betty"],
    "last_name": ["Bonder", "Black", "Balwner", "Brice", "Btisan"],
}

raw_data_3 = {"subject_id": ["1", "2", "3", "4", "6"], "test_id": [11, 12, 13, 14, 16]}

In [3]:
# Create DataFrames from the raw data
data1 = pd.DataFrame(raw_data_1, columns=["subject_id", "first_name", "last_name"])
data2 = pd.DataFrame(raw_data_2, columns=["subject_id", "first_name", "last_name"])
data3 = pd.DataFrame(raw_data_3, columns=["subject_id", "test_id"])

display(data1)
display(data2)
display(data3)

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

  subject_id  test_id
0          1       11
1          2       12
2          3       13
3          4       14
4          6       16

In [ ]:
# Save the DataFrames to an Excel file with separate sheets

In [ ]:
# Concatenate data1 and data2 vertically

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [ ]:
# Reset index after concatenation

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
5          4      Billy    Bonder
6          5      Brian     Black
7          6       Bran   Balwner
8          7      Bryce     Brice
9          8      Betty    Btisan

In [ ]:
# Concatenate data1 and data2 horizontally

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson          4      Billy    Bonder
1          2        Amy  Ackerman          5      Brian     Black
2          3      Allen       Ali          6       Bran   Balwner
3          4      Alice      Aoni          7      Bryce     Brice
4          5     Ayoung   Atiches          8      Betty    Btisan

In [ ]:
# Display data3
display(data3)

### Join diagram

[Link](https://data36.com/wp-content/uploads/2018/08/4-pandas-merge-inner-outer-left-right-768x579.png)

In [ ]:
# Merge all_data and data3 along the subject_id value (inner join)

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       11
1          2        Amy  Ackerman       12
2          3      Allen       Ali       13
3          4      Alice      Aoni       14

In [ ]:
# Merge all_data and data3 along the subject_id value (left join)

  subject_id first_name last_name  test_id
0          1       Alex  Anderson     11.0
1          2        Amy  Ackerman     12.0
2          3      Allen       Ali     13.0
3          4      Alice      Aoni     14.0
4          5     Ayoung   Atiches      NaN

In [ ]:
# Merge all_data and data3 along the subject_id value (right join)

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       11
1          2        Amy  Ackerman       12
2          3      Allen       Ali       13
3          4      Alice      Aoni       14
4          6        NaN       NaN       16

In [ ]:
# Merge all_data and data3 along the subject_id value (outer join)

  subject_id first_name last_name  test_id
0          1       Alex  Anderson     11.0
1          2        Amy  Ackerman     12.0
2          3      Allen       Ali     13.0
3          4      Alice      Aoni     14.0
4          5     Ayoung   Atiches      NaN
5          6        NaN       NaN     16.0

In [ ]:
# Change columns header of data1 and data3 so that they are not matched.


# Merge all_data and data3 along the subject_id value (innter join)

  id1 first_name last_name id3  test_id
0   1       Alex  Anderson   1       11
1   2        Amy  Ackerman   2       12
2   3      Allen       Ali   3       13
3   4      Alice      Aoni   4       14

### Join `dummy_data1` and `dummy_data2` and the merge with the `dummy_data3`

In [ ]:
dummy_data1 = {
    "id": ["1", "2", "3", "4", "5"],
    "Feature1": ["A", "C", "E", "G", "I"],
    "Feature2": ["B", "D", "F", "H", "J"],
}

dummy_data2 = {
    "id": ["1", "2", "6", "7", "8"],
    "Feature1": ["K", "M", "O", "Q", "S"],
    "Feature2": ["L", "N", "P", "R", "T"],
}

dummy_data3 = {
    "id": ["1", "2", "3", "4", "5", "7", "8", "9", "10", "11"],
    "Feature3": [12, 13, 14, 15, 16, 17, 15, 12, 13, 23],
}